Revit 2024 API
AnalyticalPanel.Create Method (Document, CurveLoop)
 Creates a new instance of an Analytical Panel within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static AnalyticalPanel Create(
	Document aDoc,
	CurveLoop curveLoop
)
Visual Basic
Public Shared Function Create ( _
	aDoc As Document, _
	curveLoop As CurveLoop _
) As AnalyticalPanel
Visual C++
public:
static AnalyticalPanel^ Create(
	Document^ aDoc,
	CurveLoop^ curveLoop
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 Revit document.
curveLoop
Type: Autodesk.Revit.DB.CurveLoop
 CurveLoop for the Analytical Panel.
Return Value
 The newly created AnalyticalPanel instance.
Remarks
 CurveLoop must be planar and not self-intersecting.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  One of the following requirements is not satisfied : - curve loop curveLoop is not planar - curve loop curveLoop is self-intersecting - curve loop curveLoop contains zero length curves
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
AnalyticalPanel Class
Create Overload
Autodesk.Revit.DB.Structure Namespace